tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
brew "bat"
brew "cmake"
brew "curl"
brew "diff-so-fancy"
brew "exa"
brew "fasd"
brew "fcitx-remote-for-osx"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "graphviz"
brew "htop"
brew "jq"
brew "make"
brew "ncdu"
brew "neovim"
brew "pandoc"
brew "prettyping"
brew "proxychains-ng"
brew "pyenv"
brew "rbenv"
brew "rustup-init"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "yarn"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "dotnet"
cask "font-anonymouspro-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "mounty"
cask "vnote"
cask "xquartz"
